{
    "translation": {
        "about": "About",
        "code": "© Code by Yordani",
        "contact": "Contact",
        "description": "Hi! I'm Yordani. I'm passionate about development. In this digital space I'm sharing my work and projects. It's a reflection of my creativity, dedication and professional growth.",
        "download": "Download Cv",
        "emailsent": "Email sent!",
        "english": "English",
        "formcompany": "What's the name of your organization?",
        "formemail": "What's your email?",
        "formmessage": "Your message",
        "formmessageph": "Hi Yordani, can you help me with...*",
        "formname": "What's your name?",
        "formtitle": "Got a project in mind?",
        "home": "Home",
        "location": "Located in the heart of the city of Buenos Aires, Argentina",
        "menu": "menu",
        "name": "Yordani Jimenez",
        "navigation": "NAVIGATION",
        "profession": "FullStack Dev.",
        "profession1": "Scrum Master",
        "project1Description": "Design & Development",
        "extract1":"Ecommerce is a full-stack ecommerce web application. The frontend is developed with React and Redux. Users can register, authenticate, browse the product catalog, add to cart, and complete a purchase. The backend uses Node.js, Express and Sequelize for the server logic and to integrate a PostgreSQL database where products, orders, users, etc. are stored. The project demonstrates my skills to build secure and scalable full-stack web applications, with a modern and appealing frontend with React, and a robust backend with Node.js and PostgreSQL. The exhibited capabilities include authentication and authorization, business logic, and CRUD data operations with a relational database.",
        "project2Description": "Design & Development",
        "extract2":"Pokedex is a web application developed with React, Redux and Material UI that consumes the PokeAPI to display data of different Pokémon. Users can view a complete list of Pokémon or search by name to find specific information like stats, moves, types and weaknesses. I implemented pagination and filters to improve user experience. The details of each Pokémon are displayed in a card with a clean, modern design thanks to Material UI. This project demonstrates my skills consuming and working with external APIs in the frontend, as well as creating attractive and dynamic interfaces with React and Redux.",
        "project3Description": "Design & Development",
        "extract3":"CrudUsers is a web application developed with React, TypeScript and Tailwind CSS that allows managing users with CRUD operations (create, read, update, delete). The interface allows viewing a list of users, adding new ones, editing information and deleting. Data is temporarily stored in React state with hooks and TypeScript provides static typing. The project demonstrates my skills in developing web applications with React and TypeScript, creating responsive interfaces with Tailwind CSS. The showcased capabilities include CRUD operations, state management with hooks, form validations, and use of static typing to improve maintainability.",
        "project4Description": "Design & Development",
        "extract4":"RickAndMorty is a web application developed with React and TailwindCSS that consumes the Rick and Morty API to display character information. Users can explore different characters, view details like their species, origin and episodes they appear in. Character screenshots are also displayed. The interface is designed responsively with TailwindCSS. The information is fetched dynamically from the API and rendered with reusable components. This project demonstrates my skills consuming external APIs, creating dynamic interfaces with React, and building a modern, adaptable design with TailwindCSS.",
        "project5Description": "Design & Development",
        "extract5":"Weather is a web application developed with React that consumes the OpenWeatherMap API to get weather data. Users can search by city and see the current weather, the forecast for the day and week with details like temperature, humidity and wind speed. The interface shows representative icons of the weather conditions and clean charts with the information. The data updates dynamically when changing locations. The project demonstrates my skills to consume third party APIs, clearly display data in the UI, and update the UI based on user interaction in a modern web application created with React.",
        "project6Description": "Design & Development",
        "extract6":"LoginApp is a full-stack web application that allows users to register and log in. The frontend is developed with React and Bootstrap for an intuitive and responsive interface. The backend uses Node.js, Express and Sequelize to connect to a PostgreSQL database. When registering, users receive a confirmation email to verify their account. Then they can log in and reset their password through a recovery email. This project demonstrates my full-stack development skills, handling user authentication and authorization, sending transactional emails, and using popular technologies like React, Node.js and PostgreSQL to build secure and scalable web applications.",
        "project7Description": "Design & Development",
        "extract7":"MovieApp is a full-stack web application that allows managing a movie database. The React and Bootstrap frontend provides an interface to add, modify and delete movies, directors, actors and images. The Node.js, Express and Sequelize backend connects to a PostgreSQL database to store the data. This project demonstrates my skills to build a complete content management system, from frontend to database, using technologies like React, Node.js and PostgreSQL. The exhibited capabilities include CRUD data operations, routing and navigation in the frontend, connecting to relational databases in the backend, and deploying the full-stack application.",
        "project8Description": "Design & Development",
        "extract8":"MediConnect is an innovative web application developed with React, Next JS, TailwindCSS, TypeScript, React Hook Form, Redux, Docker, NestJS and MySQL. This application revolutionizes medical appointment management by consuming proprietary APIs to facilitate communication between doctors and patients. Users can search by doctor, specialty or location, view appointment availability, book appointments, and communicate with healthcare professionals. The interface displays detailed information about each doctor, including their specialty, location, and available hours. The data updates dynamically when performing a new search or booking an appointment. This project demonstrates my skills to consume proprietary APIs, clearly display data in the UI, and update the UI based on user interaction. In addition, Jest was used for testing and Git for version control. The development team includes roles for Backend Developer, Frontend Developer, and QA Tester.",
        "projects": "RECENT PROJECTS",
        "send": "Send!",
        "separator": " - ",
        "skills": "SKILLS",
        "socials": "Socials",
        "spanish": "Spanish",
        "time": "Local Time",
        "together": "Let's work",
        "together1": "together!",
        "welcome": "Welcome to my digital space!",
        "work": "Work"
    }
}