{
    "translation": {
        "about": "Sobre mí",
        "code": "© Code by Yordani",
        "contact": "Contacto",
        "description": "Hola! Soy Yordani. Me apasiona el desarrollo. En este espacio digital comparto mi trabajo y mis  proyectos. Es una reflexión de mi creatividad, dedicación y crecimiento profesional.",
        "download": "Descargar Cv",
        "emailsent": "Email enviado!",
        "english": "Inglés",
        "formcompany": "Cuál es el nombre de tu empresa?",
        "formemail": "Cuál es tu email?",
        "formmessage": "Tu mensaje",
        "formmessageph": "Hola Yordani, podrías ayudarme con...*",
        "formname": "Cuál es tu nombre?",
        "formtitle": "Tienes un proyecto en mente?",
        "home": "Inicio",
        "location": "Ubicado en el corazón de la ciudad de Buenos Aires, Argentina",
        "menu": "menú",
        "name": "Yordani Jimenez",
        "navigation": "NAVEGACIÓN",
        "profession": "FullStack Dev.",
        "profession1": "Scrum Master",
        "project1Description": "Diseño & Desarrollo",
        "extract1":"Ecommerce es una aplicación web full-stack de comercio electrónico. El frontend está desarrollado con React y Redux. Los usuarios pueden registrarse, autenticarse, navegar el catálogo de productos, agregar al carrito y completar una compra. El backend utiliza Node.js, Express y Sequelize para la lógica del servidor e integrar una base de datos PostgreSQL donde se almacenan los productos, órdenes, usuarios, etc. El proyecto demuestra mis habilidades para construir aplicaciones web full-stack seguras y escalables, con un frontend moderno y atractivo con React, y un backend robusto con Node.js y PostgreSQL. Las capacidades exhibidas incluyen autenticación y autorización, lógica de negocios, y CRUD de datos con una base de datos relacional.",
        "project2Description": "Diseño & Desarrollo",
        "extract2":"Pokedex es una aplicación web desarrollada con React, Redux y Material UI que consume la API de PokeAPI para mostrar datos de diferentes Pokémon. Los usuarios pueden ver una lista completa de Pokémon o buscar por nombre para encontrar información específica como estadísticas, movimientos, tipos y debilidades. Implementé paginación y filtros para mejorar la experiencia de usuario. Los detalles de cada Pokémon se muestran en una tarjeta con un diseño limpio y moderno gracias a Material UI. Este proyecto demuestra mis habilidades consumiendo y trabajando con APIs externas en el frontend, además de crear interfaces atractivas y dinámicas con React y Redux.",
        "project3Description": "FrontEnd & BackEnd",
        "extract3":"CrudUsers es una aplicación web desarrollada con React, TypeScript y Tailwind CSS que permite administrar usuarios con operaciones CRUD (crear, leer, actualizar, eliminar). La interfaz permite ver una lista de usuarios, agregar nuevos, editar la información y eliminar. Los datos se almacenan temporalmente en el estado de React con hooks y TypeScript aporta tipado estático. El proyecto demuestra mis habilidades en el desarrollo de aplicaciones web con React y TypeScript, creando interfaces responsive con Tailwind CSS. Las capacidades mostradas incluyen operaciones CRUD, manejo de estado con hooks, validaciones en los formularios, y uso de tipado estático para mejorar el maintainability.",
        "project4Description": "Diseño & Desarrollo",
        "extract4":"RickAndMorty es una aplicación web desarrollada con React y TailwindCSS que consume la API de Rick and Morty para mostrar información de los personajes. Los usuarios pueden explorar los distintos personajes, ver detalles como su especie, origen y episodios en los que aparecen. También se muestran capturas de los personajes. La interfaz está diseñada responsivamente con TailwindCSS. La información se obtiene dinámicamente desde la API con fetches y se renderiza con componentes reutilizables. Este proyecto demuestra mis habilidades consumiendo APIs externas, creando interfaces dinámicas con React, y construyendo un diseño moderno y adaptable con TailwindCSS.",
        "project5Description": "Diseño & Desarrollo",
        "extract5":"Weather es una aplicación web desarrollada con React que consume la API de OpenWeatherMap para obtener datos meteorológicos. Los usuarios pueden buscar por ciudad y ver el clima actual, el pronóstico para el día y la semana con detalles como temperatura, humedad y velocidad del viento. La interfaz muestra iconos representativos del estado del tiempo y gráficos limpios con la información. Los datos se actualizan dinámicamente al cambiar de ubicación. El proyecto demuestra mis habilidades para consumir APIs de terceros, mostrar los datos de forma clara en la interfaz, y actualizar la UI en función de la interacción del usuario en una aplicación web moderna creada con React.",
        "project6Description": "Diseño & Desarrollo",
        "extract6":"LoginApp es una aplicación web full-stack que permite a los usuarios registrarse e iniciar sesión. El frontend está desarrollado con React y Bootstrap para una interfaz intuitiva y responsive. El backend utiliza Node.js, Express y Sequelize para conectarse a una base de datos PostgreSQL. Al registrarse, los usuarios reciben un email de confirmación para verificar su cuenta. Luego pueden iniciar sesión y restablecer su contraseña a través de un email de recuperación. Este proyecto demuestra mis habilidades en desarrollo full-stack, manejo de autenticación y autorización de usuarios, envío de emails transaccionales, y uso de tecnologías populares como React, Node.js y PostgreSQL para construir aplicaciones web seguras y escalables.",
        "project7Description": "Diseño & Desarrollo",
        "extract7":"MovieApp es una aplicación web full-stack que permite administrar una base de datos de películas. El frontend hecho con React y Bootstrap ofrece una interfaz para agregar, modificar y eliminar películas, directores, actores e imágenes. El backend desarrollado con Node.js, Express y Sequelize se conecta a una base de datos PostgreSQL para almacenar los datos. Este proyecto demuestra mis habilidades para construir un sistema completo de administración de contenidos, desde el frontend hasta la base de datos, utilizando tecnologías como React, Node.js y PostgreSQL. Las capacidades que exhibe incluyen CRUD de datos, ruteo y navegación en el frontend, conexión a bases de datos relacionales en el backend, y despliegue de la aplicación full-stack.",
        "project8Description": "Diseño & Desarrollo",
        "extract8":"MediConnect es una aplicación web innovadora desarrollada con React, Next JS, TailwindCSS, TypeScript, React Hook Form, Redux, Docker, NestJS y MySQL. Esta aplicación revoluciona la gestión de turnos médicos al consumir APIs propias para facilitar la comunicación entre médicos y pacientes. Los usuarios pueden buscar por médico, especialidad o ubicación, ver la disponibilidad de turnos, reservar citas y comunicarse con los profesionales de la salud. La interfaz muestra información detallada sobre cada médico, incluyendo su especialidad, ubicación y horarios disponibles. Los datos se actualizan dinámicamente al realizar una nueva búsqueda o al reservar un turno. Este proyecto demuestra mis habilidades para consumir APIs propias, mostrar los datos de forma clara en la interfaz, y actualizar la UI en función de la interacción del usuario. Además, se utilizó Jest para los tests y Git para el control de versiones. El equipo de desarrollo incluye roles de Backend Developer, Frontend Developer y QA Tester.",
        "projects": "PROYECTOS RECIENTES",
        "send": "Enviar!",
        "separator": " - ",
        "skills": "HABILIDADES",
        "socials": "Redes",
        "spanish": "Español",
        "time": "Hora Local",
        "together": "Trabajemos",
        "together1": "juntos!",
        "welcome": "Bienvenido a mi espacio digital!",
        "work": "Proyectos"
    }
}